usevolt/uv_hal/uv_hal/src_lpc1785/uv_can.c
}





uv_errors_e uv_can_config_rx_message(uv_can_channels_e channel,
		unsigned int id,
		unsigned int mask,
		uv_can_msg_types_e type) {

	// if any message objects are still not in use,
	// config them with settings requested
	// the last message object is reserved for sending messages
	uint8_t i;
	for (i = 0; i < 31; i++) {
		// search for a unused message object to be used for receiving the messages
		if (!GET_MASKED(this->used_msg_objs, (1 << i))) {
			hal_can_msg_obj_st obj = {
					.msg_id = id | type,
					.msgobj = i,
					.mask = mask,
			};
			LPC_CCAN_API->config_rxmsgobj(&obj);
			this->used_msg_objs |= (1 << i);
			return uv_err(ERR_NONE);
		}
	}
	__uv_err_throw(ERR_CAN_RX_MESSAGE_COUNT_FULL | HAL_MODULE_CAN);
}



void _uv_can_hal_send(uv_can_channels_e chn) {
	if (chn);

	// if tx object is pending, try to wait for the HAl task to release the pending msg obj
	if (this->tx_pending > 0) {
		return;
	}

	uv_can_message_st msg;
	uv_errors_e e = uv_ring_buffer_pop(&this->tx_buffer, &msg);
	// empty buffer
	if (e) {
		return;
	}

	// the last MSG OBJ is used for transmitting the messages
	hal_can_msg_obj_st obj = {
			.data_length = msg.data_length,
			.msg_id = msg.id | msg.type,
			.msgobj = TX_MSG_OBJ,
	};
	uint8_t i;
	for (i = 0; i < obj.data_length; i++) {
		obj.data[i] = msg.data_8bit[i];
	}

	// send the message
	LPC_CCAN_API->can_transmit(&obj);
	this->tx_pending = PENDING_MSG_OBJ_TIME_LIMIT_MS;
}




uv_can_errors_e uv_can_get_error_state(uv_can_channels_e channel) {
	if (channel) {};
	uv_can_errors_e e = CAN_ERROR_ACTIVE;

	if (LPC_CAN->STAT & (1 << 7)) {
		e = CAN_ERROR_BUS_OFF;
	}
	else if (LPC_CAN->STAT & (1 << 5)) {
		e = CAN_ERROR_PASSIVE;
	}
	else if (LPC_CAN->STAT & (1 << 6)) {
		e = CAN_ERROR_WARNING;
	}
	else {

	}
	return e;
}



uv_errors_e uv_can_reset(uv_can_channels_e channel) {
#if CONFIG_TARGET_LPC11C14
	//clearing the C_CAN bit resets C_CAN hardware
	LPC_SYSCON->PRESETCTRL &= ~(1 << 3);
	//set bit to de-assert the reset
	LPC_SYSCON->PRESETCTRL |= (1 << 3);
#elif CONFIG_TARGET_LPC1549
	LPC_SYSCON->PRESETCTRL[1] |= (1 << 7);
	__NOP();
	LPC_SYSCON->PRESETCTRL[1] &= ~(1 << 7);

#endif
	return uv_err(ERR_NONE);
}








#elif CONFIG_TARGET_LPC1785










// same handler for both CAN channels
void CAN_IRQHandler(void) {
#if CONFIG_CAN0
	// CAN tranceiver is either in bus off or error active state
	if (LPC_CAN1->ICR & (0b11 << 2)) {
		LPC_CAN1->MOD &= ~1;
		return;
	}

	if (LPC_CAN1->GSR & (1 << 2)) {
		_uv_can_hal_send(CAN0);
	}
	while (LPC_CAN1->GSR & 1) {
		// data ready to be received
		this->temp.id = LPC_CAN1->RID;
		this->temp.data_length = ((LPC_CAN1->RFS & (0b1111 << 16)) >> 16);
		if (this->temp.data_length > 8) this->temp.data_length = 8;
		this->temp.type = (LPC_CAN1->RFS & (1 << 31)) ? CAN_EXT : CAN_STD;
		this->temp.data_32bit[0] = LPC_CAN1->RDA;
		this->temp.data_32bit[1] = LPC_CAN1->RDB;

#if CONFIG_TERMINAL_CAN
	// terminal characters are sent to their specific buffer
	if (this->temp.id == UV_TERMINAL_CAN_RX_ID + uv_get_id() &&
			this->temp.type == CAN_STD &&
			this->temp.data_8bit[0] == 0x22 &&
			this->temp.data_8bit[1] == (UV_TERMINAL_CAN_INDEX & 0xFF) &&
			this->temp.data_8bit[2] == UV_TERMINAL_CAN_INDEX >> 8 &&
			this->temp.data_8bit[3] == UV_TERMINAL_CAN_SUBINDEX &&
			this->temp.data_length > 4) {
		uint8_t i;
		for (i = 0; i < this->temp.data_length - 4; i++) {
			uv_ring_buffer_push(&this->char_buffer, (char*) &this->temp.data_8bit[4 + i]);
		}
		// clear received flag
		LPC_CAN1->CMR |= (1 << 2);
		continue;
	}
#endif
		uv_ring_buffer_push(&this->rx_buffer[0], &this->temp);

		// clear received flag
		LPC_CAN1->CMR = (1 << 2);
	}

#endif
#if CONFIG_CAN1
#error "Todo: copy CAN0 message reception to here"
#endif
}


uv_errors_e _uv_can_init() {
	uv_errors_e ret = ERR_NONE;

#if CONFIG_CAN0
	uv_ring_buffer_init(&this->rx_buffer[0], this->rx_buffer_data1,
			CONFIG_CAN0_RX_BUFFER_SIZE, sizeof(uv_can_message_st));

	uv_ring_buffer_init(&this->tx_buffer[0], this->tx_buffer_data1,
			CONFIG_CAN0_TX_BUFFER_SIZE, sizeof(uv_can_message_st));

	this->rx_callback[0] = NULL;

	// enable power to the peripheral
	LPC_SC->PCONP |= (1 << 13);

	// configure the IO pins
#if CONFIG_CAN0_TX_PIN == PIO0_1
	LPC_IOCON->P0_1 = 1;
#elif CONFIG_CAN0_TX_PIN == PIO0_22
	LPC_IOCON->P0_22 = 0b100;
#endif
#if CONFIG_CAN0_RX_PIN == PIO0_0
	LPC_IOCON->P0_0 = 1;
#elif CONFIG_CAN0_RX_PIN == PIO0_21
	LPC_IOCON->P0_21 = 0b100;
#endif
	// enter reset mode
	LPC_CAN1->MOD |= 1;
	// normal mode, transmit priority to CAN IDs, no sleep mode
	LPC_CAN1->MOD &= ~(0b10111110);
	// enable receive interrupts and transmit interrupts
	LPC_CAN1->IER = 1 | (1 << 2) | (1 << 1) | (1 << 9) | (1 << 10);
	NVIC_EnableIRQ(CAN_IRQn);
	// TSEG1, TSEG2
	LPC_CAN1->BTR = (12 << 16) | (1 << 20);
	// for some reason incrementing TSEG by 1 needs CANX_BAUDRATE to be divided by 2
	LPC_CAN1->BTR |= (SystemCoreClock / (CONFIG_CAN0_BAUDRATE * 32) - 1) & 0x3FF;

//	LPC_CAN->BT = (SystemCoreClock / (CONFIG_CAN0_BAUDRATE * 8) & 0x3F)
//				  | (1 << 8) | (2 << 12);

	// set CAN peripheral ON
	LPC_CAN1->MOD &= ~1;

#endif
#if CONFIG_CAN1
	uv_ring_buffer_init(&this->rx_buffer[1], this->rx_buffer_data2,
			CONFIG_CAN1_RX_BUFFER_SIZE, sizeof(uv_can_message_st));

	this->rx_callback[1] = NULL;
#error "Todo: Copy CAN0 initialization here"

	LPC_SC->PCONP |= (1 << 14);

#if CONFIG_CAN1_TX_PIN == PIO0_5
	LPC_IOCON->P0_5 = 0b10;
#elif CONFIG_CAN1_TX_PIN == PIO2_8
	LPC_IOCON->P2_8 = 1;
#endif
#if CONFIG_CAN1_RX_PIN == PIO0_4
	LPC_IOCON->P0_4 = 0b10;
#elif CONFIG_CAN1_RX_PIN == PIO2_7
	LPC_IOCON->P2_7 = 1;
#endif

#endif


	// set acceptance filter to idle mode
	LPC_CANAF->AFMR = 0b10;

	LPC_CANAF->SFF_sa = 0;
	LPC_CANAF->SFF_GRP_sa = 0;
	LPC_CANAF->EFF_sa = 0;
	LPC_CANAF->EFF_GRP_sa = 0;
	LPC_CANAF->ENDofTable = 0;

	// enable acceptance filter
	LPC_CANAF->AFMR = 0;

#if CONFIG_TERMINAL_CAN
	uv_ring_buffer_init(&this->char_buffer, this->char_buffer_data, CONFIG_TERMINAL_BUFFER_SIZE, sizeof(char));
#if !CONFIG_CANOPEN
	uv_can_config_rx_message(CAN0, UV_TERMINAL_CAN_RX_ID + uv_get_id(), CAN_STD);
#endif

#endif

