usevolt/uv_hal/uv_hal/src_lpc1785/uv_can.c
	this->init = true;


	return ret;
}



#define STD_ID(chn, x)				(((LPC_CANAF_RAM->mask[x]) & (0x7FF << (chn*16))) >> (chn*16))
#define SET_STD_ID(chn, x, val)	(LPC_CANAF_RAM->mask[x]) &= ~(0x7FF << (chn*16)); \
	(LPC_CANAF_RAM->mask[x]) |= ((val & 0x7FF) << (chn*16))

#define STD_DISABLE(chn, x) 		(((LPC_CANAF_RAM->mask[x]) & (1 << (12 + chn*16))) >> (12 + chn*16))
#define SET_STD_DISABLE(chn, x, val) (LPC_CANAF_RAM->mask[x]) &= ~(1 << (12 + chn*16)); \
	(LPC_CANAF_RAM->mask[x]) |= ((val & 1) << (12 + chn*16))

#define STD_CHANNEL(chn, x) 		(((LPC_CANAF_RAM->mask[x]) & (0b111 << (13 + chn*16))) >> (13 + chn*16))
#define SET_STD_CHANNEL(chn, x, val) (LPC_CANAF_RAM->mask[x]) &= ~(0b111 << (13 + chn*16)); \
	(LPC_CANAF_RAM->mask[x]) |= ((val & 0b111) << (13 + chn*16))

#define STD_RANGE_ID_LOW(x)				(((LPC_CANAF_RAM->mask[x]) & (0x7FF << 16)) >> 16)
#define SET_STD_RANGE_ID_LOW(id, x)		LPC_CANAF_RAM->mask[x] &= ~(0x7FF << 16); \
										LPC_CANAF_RAM->mask[x] |= (id << 16)

#define STD_RANGE_ID_HIGH(x)			(((LPC_CANAF_RAM->mask[x]) & (0x7FF)))
#define SET_STD_RANGE_ID_HIGH(id, x)	LPC_CANAF_RAM->mask[x] &= ~(0x7FF); \
										LPC_CANAF_RAM->mask[x] |= id

#define STD_RANGE_CHANNEL(x)			(((LPC_CANAF_RAM->mask[x]) & (0b111 << 13)) >> 13)
#define SET_STD_RANGE_CHANNEL(chn, x)	LPC_CANAF_RAM->mask[x] &= ~((0b111 << 13) | (0b111 << 29));\
										LPC_CANAF_RAM->mask[x] |= ((chn << 13) | (chn << 29))

#define SET_STD_RANGE_DISABLE(value, x)	LPC_CANAF_RAM->mask[x] &= ~((1 << 12) | (1 << 28)); \
										LPC_CANAF_RAM->mask[x] |= ((value << 12) | (value << 28))

#define EXT_ID(x)				(LPC_CANAF_RAM->mask[x] & 0x1FFFFFFF)
#define SET_EXT_ID(x, val)	(LPC_CANAF_RAM->mask[x] &= ~0x1FFFFFFF); \
	(LPC_CANAF_RAM->mask[x] |= (val))

#define EXT_CHANNEL(x) 		((LPC_CANAF_RAM->mask[x] & 0xE0000000) >> 29)
#define SET_EXT_CHANNEL(x, chn) LPC_CANAF_RAM->mask[x] &= ~0xE0000000; \
	LPC_CANAF_RAM->mask[x] |= ((chn) << 29)


/// @brief: Acceptance filter length
#define AC_LEN		2048

uv_errors_e uv_can_config_rx_message(uv_can_channels_e channel,
		unsigned int id,
		uv_can_msg_types_e type) {
	uv_errors_e ret = ERR_NONE;

	// set acceptance filter to idle mode
	LPC_CANAF->AFMR = 0b10;

#if CONFIG_CAN0
		if (channel == CAN0) channel = 0;
#endif
#if CONFIG_CAN1
		if (channel == CAN1) channel = 1;
#endif

	if (type == CAN_STD) {
		uint32_t i = LPC_CANAF->SFF_sa / 4;

		// since every 32-bit word contains 2 individual messages and it would
		// be hard to parse them all, both of the messages in the same word are
		// written. 1st message is for channel 1 and 2nd message is for channel 2.

		bool inserted = false;
		// cycle trough all registered messages and find the position where to insert new one
		while (i < LPC_CANAF->SFF_GRP_sa / 4) {
			// Check if this message's ID is smaller
			if (id < STD_ID(channel, i)) {
				// copy all messages one word forward
				for (int in = LPC_CANAF->ENDofTable / 4; in >= i; in--) {
					LPC_CANAF_RAM->mask[in] = LPC_CANAF_RAM->mask[in - 1];
				}
				LPC_CANAF->SFF_GRP_sa += 4;
				LPC_CANAF->EFF_sa += 4;
				LPC_CANAF->EFF_GRP_sa += 4;
				LPC_CANAF->ENDofTable += 4;

				LPC_CANAF_RAM->mask[i] = 0;
				SET_STD_CHANNEL(0, i, 0);
				SET_STD_CHANNEL(1, i, 1);
				SET_STD_DISABLE(channel, i, 0);
				SET_STD_DISABLE(!channel, i, 1);
				SET_STD_ID(0, i, id);
				SET_STD_ID(1, i, id);

				inserted = true;
				break;
			}
			else if (id == STD_ID(channel, i)) {
				// existing entry found. Make sure that the disable bit is cleared
				SET_STD_DISABLE(channel, i, 0);
				inserted = true;
				break;
			}
			i++;
		}
		if (!inserted) {
			// No smaller ID messages found from the RAM. Add new entry
			// to the end of the STD RAM
			// copy all messages one word forward
			for (int in = LPC_CANAF->ENDofTable / 4; in >= (int) i; in--) {
				if (in) {
					LPC_CANAF_RAM->mask[in] = LPC_CANAF_RAM->mask[in - 1];
				}
			}
			LPC_CANAF->SFF_GRP_sa += 4;
			LPC_CANAF->EFF_sa += 4;
			LPC_CANAF->EFF_GRP_sa += 4;
			LPC_CANAF->ENDofTable += 4;

			LPC_CANAF_RAM->mask[i] = 0;
			SET_STD_CHANNEL(0, i, 0);
			SET_STD_CHANNEL(1, i, 1);
			SET_STD_DISABLE(channel, i, 0);
			SET_STD_DISABLE(!channel, i, 1);
			SET_STD_ID(0, i, id);
			SET_STD_ID(1, i, id);
		}
	}
	else {
		uint32_t i = LPC_CANAF->EFF_sa / 4;

		// every entry is an individual message

		bool inserted = false;
		// cycle trough all registered messages and find the position where to insert new one
		while (i < LPC_CANAF->EFF_GRP_sa / 4) {
			// continue is this object is not for this channel
			if (EXT_CHANNEL(i) != channel) {
				i++;
				continue;
			}
			// Check if this message's ID is smaller
			if (id < EXT_ID(i)) {
				// copy all messages one word forward
				for (int in = LPC_CANAF->ENDofTable / 4; in >= i; in--) {
					if (in) {
						LPC_CANAF_RAM->mask[in] = LPC_CANAF_RAM->mask[in - 1];
					}
				}
				LPC_CANAF->EFF_GRP_sa += 4;
				LPC_CANAF->ENDofTable += 4;

				LPC_CANAF_RAM->mask[i] = 0;
				SET_EXT_CHANNEL(i, channel);
				SET_EXT_ID(i, id);

				inserted = true;
				break;
			}
			else if (id == EXT_ID(i)) {
				inserted = true;
				break;
			}
			i++;
		}
		if (!inserted) {

			// No smaller ID messages found from the RAM. Add new entry
			// to the end of the EXT RAM
			// copy all messages one word forward
			for (int in = LPC_CANAF->ENDofTable / 4; in >= (int) i; in--) {
				LPC_CANAF_RAM->mask[in] = LPC_CANAF_RAM->mask[in - 1];
			}
			LPC_CANAF->EFF_GRP_sa += 4;
			LPC_CANAF->ENDofTable += 4;

			LPC_CANAF_RAM->mask[i] = 0;
			SET_EXT_CHANNEL(i, channel);
			SET_EXT_ID(i, id);
		}
	}

	// enable acceptance filter
	LPC_CANAF->AFMR = 0;

	return ret;
}




void _uv_can_hal_send(uv_can_channels_e channel) {
#if CONFIG_CAN0
	if (channel == CAN0) {
		uv_can_message_st msg;
		uv_errors_e e = uv_ring_buffer_peek(&this->tx_buffer[0], &msg);
		if (e) {
			return;
		}

		// if any transmit buffer has same ID message to be transmitted, wait until
		// the older message is transmitted.
		while ((LPC_CAN1->TID1 == msg.id && !(LPC_CAN1->SR & (1 << 2))) ||
				(LPC_CAN1->TID2 == msg.id && !(LPC_CAN1->SR & (1 << 10))) ||
				(LPC_CAN1->TID3 == msg.id && !(LPC_CAN1->SR & (1 << 18)))) {
			// CAN tranceiver is in bus off
			if (LPC_CAN1->GSR & (0b1 << 7)) {
				LPC_CAN1->MOD &= ~1;
			}
			return;
		}

		// wait until any one transmit buffer is available for transmitting
		while (!(LPC_CAN1->SR & ((1 << 2) | (1 << 10) | (1 << 18)))) {
			// CAN tranceiver is either in bus off or error passive state
			// and last received error was in ACK slot.
			// This means that the device may be the only one in the CAN bus,
			// and in that case its OK to discard the message transmission
			if (LPC_CAN1->GSR & (0b1 << 7)) {
				LPC_CAN1->MOD &= ~1;
				return;
			}
		}

		if (LPC_CAN1->SR & (1 << 2)) {
			LPC_CAN1->TFI1 = (msg.data_length << 16) |
					((msg.type == CAN_EXT) ? (1 << 31) : 0);
			LPC_CAN1->TID1 = msg.id;
			LPC_CAN1->TDA1 = msg.data_32bit[0];
			LPC_CAN1->TDB1 = msg.data_32bit[1];
			// send message
			LPC_CAN1->CMR = (1 | (1 << 5));
		}
		else if (LPC_CAN1->SR & (1 << 10)) {
			LPC_CAN1->TFI2 = (msg.data_length << 16) |
					((msg.type == CAN_EXT) ? (1 << 31) : 0);
			LPC_CAN1->TID2 = msg.id;
			LPC_CAN1->TDA2 = msg.data_32bit[0];
			LPC_CAN1->TDB2 = msg.data_32bit[1];
			// send message
			LPC_CAN1->CMR = (1 | (1 << 6));
		}
		else if (LPC_CAN1->SR & (1 << 18)) {
			LPC_CAN1->TFI3 = (msg.data_length << 16) |
					((msg.type == CAN_EXT) ? (1 << 31) : 0);
			LPC_CAN1->TID3 = msg.id;
			LPC_CAN1->TDA3 = msg.data_32bit[0];
			LPC_CAN1->TDB3 = msg.data_32bit[1];
			// send message
			LPC_CAN1->CMR = (1 | (1 << 7));
		}
		// message succesfully sent, remove it from the buffer
		uv_ring_buffer_pop(&this->tx_buffer[0], NULL);

		return;
	}
#endif
#if CONFIG_CAN1
	if (channel == CAN1) {
#error "Copy CAN0 message transmission here"
	}
#endif

	return;
}



uv_can_errors_e uv_can_get_error_state(uv_can_channels_e channel) {
	uv_can_errors_e ret = CAN_ERROR_ACTIVE;
#if CONFIG_CAN0
	if (channel == CAN0) {
		if (LPC_CAN1->GSR & (1 << 7)) {
			ret = CAN_ERROR_BUS_OFF;
		}
		else if (LPC_CAN1->GSR & (1 << 6)) {
			ret = CAN_ERROR_PASSIVE;
		}
		else {
			ret = CAN_ERROR_ACTIVE;
		}
	}
#endif
#if CONFIG_CAN1
#error "Copy CAN0 error state getter here"
#endif
	return ret;
}







uv_errors_e uv_can_add_rx_callback(uv_can_channels_e channel,
		void (*callback_function)(void *user_ptr)) {
	uv_errors_e ret = ERR_NONE;

	this->rx_callback[channel] = callback_function;
	return ret;
}





