usevolt/uv_hal/uv_hal/src_lpc1785/uv_can.c
#elif CONFIG_TARGET_LPC1549

#define TX_MSG_OBJ	1


/// @brief: Time limit for pending message objects. If this exceeds, all message objects are
/// released from pending state.
#define PENDING_MSG_OBJ_TIME_LIMIT_MS		8


static uint32_t get_msgif_id(const bool ext) {
	uint32_t id;
	if (ext) {
		id = LPC_CAN->IF1_ARB1;
		id += (LPC_CAN->IF1_ARB2 & 0x1FFF) << 16;
	}
	else {
		id = (LPC_CAN->IF1_ARB2 & 0x1FFF) >> 2;
	}
	return id;
}

static void set_msgif_id(const uint32_t id, const bool ext) {
	if (ext) {
		LPC_CAN->IF1_ARB1 = id & 0xFFFF;
		LPC_CAN->IF1_ARB2 &= ~(0x1FFF);
		LPC_CAN->IF1_ARB2 |= ((id >> 16) & 0x1FFF);
	}
	else {
		LPC_CAN->IF1_ARB2 &= ~(0x1FFF);
		LPC_CAN->IF1_ARB2 |= ((id & 0x7FF) << 2);
	}
}

static uint32_t get_msgif_mask(const uv_can_msg_types_e type) {
	uint32_t mask;
	if (type == CAN_EXT) {
		mask = LPC_CAN->IF1_MSK1 + ((LPC_CAN->IF1_MSK2 & 0x1FFF) << 16);
	}
	else {
		mask = (LPC_CAN->IF1_MSK2 & 0x1FFF) >> 2;
	}
	return mask;
}

static void set_msgif_mask(const uint32_t mask, const uv_can_msg_types_e type) {
	if (type == CAN_EXT) {
		LPC_CAN->IF1_MSK1 = mask & 0xFFFF;
		LPC_CAN->IF1_MSK2 &= ~(0x1FFF);
		LPC_CAN->IF1_MSK2 |= ((mask >> 16) & 0x1FFF);
	}
	else {
		LPC_CAN->IF1_MSK1 = 0xFFFF;
		LPC_CAN->IF1_MSK2 &= ~(0x1FFF);
		LPC_CAN->IF1_MSK2 |= ((mask & 0x7FF) << 2);
	}
}

/// @return: 1 if extended, 0 if standard
static inline uint8_t get_msgif_type(void) {
	return ((LPC_CAN->IF1_ARB2 & (1 << 14)) >> 14);
}

static void read_msg_obj(uint8_t msg_obj) {
	// load the whole message
	LPC_CAN->IF1_CMDMSK = 0x7F;
	while (LPC_CAN->IF1_CMDREQ & (1 << 15));
	LPC_CAN->IF1_CMDREQ = msg_obj;
	while (LPC_CAN->IF1_CMDREQ & (1 << 15));
}

static void write_msg_obj(uint8_t msg_obj, bool txrqst) {
	LPC_CAN->IF1_CMDMSK = 0xFB | ((txrqst ? 1 : 0) << 2);
	while(LPC_CAN->IF1_CMDREQ & (1 << 15));
	LPC_CAN->IF1_CMDREQ = msg_obj;
	while(LPC_CAN->IF1_CMDREQ & (1 << 15));
}

static void msg_obj_enable(uint8_t msg_obj) {
	read_msg_obj(msg_obj);
	LPC_CAN->IF1_ARB2 |= (1 << 15);
	write_msg_obj(msg_obj, false);
}

static void msg_obj_disable(uint8_t msg_obj) {
	read_msg_obj(msg_obj);
	LPC_CAN->IF1_ARB2 &= ~(1 << 15);
	write_msg_obj(msg_obj, false);
}



void CAN_IRQHandler(void) {
	volatile uint32_t p = LPC_CAN->INT;

	if (p <= 0x20) {
		uint32_t int_pend = LPC_CAN->IR1 | (LPC_CAN->IR2 << 16);
		while (int_pend) {
			// find out the pending message object
			uint8_t msg_obj = 0;
			for (msg_obj = 0; msg_obj < 32; msg_obj++) {
				if (int_pend & (1 << msg_obj)) {

					__disable_irq();

					// read the pending object
					read_msg_obj(msg_obj + 1);

					if ((msg_obj + 1) != TX_MSG_OBJ) {
						// copy the message data and push it into rx ring buffer
						uv_can_msg_st msg;
						msg.type = (LPC_CAN->IF1_ARB2 & (1 << 14)) ? CAN_EXT : CAN_STD;
						msg.data_length = LPC_CAN->IF1_MCTRL & 0b1111;
						msg.id = get_msgif_id(msg.type == CAN_EXT);
						msg.data_16bit[0] = LPC_CAN->IF1_DA1;
						msg.data_16bit[1] = LPC_CAN->IF1_DA2;
						msg.data_16bit[2] = LPC_CAN->IF1_DB1;
						msg.data_16bit[3] = LPC_CAN->IF1_DB2;

#if CONFIG_TERMINAL_CAN
						// terminal characters are sent to their specific buffer
						if (msg.id == UV_TERMINAL_CAN_RX_ID + uv_get_id() &&
								msg.type == CAN_STD &&
								msg.data_8bit[0] == 0x22 &&
								msg.data_8bit[1] == (UV_TERMINAL_CAN_INDEX & 0xFF) &&
								msg.data_8bit[2] == UV_TERMINAL_CAN_INDEX >> 8 &&
								msg.data_8bit[3] == UV_TERMINAL_CAN_SUBINDEX &&
								msg.data_length > 4) {
							uint8_t i;
							for (i = 0; i < msg.data_length - 4; i++) {
								uv_ring_buffer_push(&this->char_buffer, (char*) &msg.data_8bit[4 + i]);
							}
						}
						else {
#endif
							uv_ring_buffer_push(&this->rx_buffer, &msg);
#if CONFIG_TERMINAL_CAN
						}
#endif
					}
					int_pend &= ~(1 << msg_obj);

					__enable_irq();

					if ((msg_obj + 1) == TX_MSG_OBJ) {
						_uv_can_hal_send(CAN0);
					}
				}
			}

		}
	}
	else {
		// detect bus off and fix it
		if (LPC_CAN->STAT & (1 << 7)) {
			LPC_CAN->CNTL &= ~(1);
		}
	}

	// clear status interrupts by reading the status register
	// clear succesfull rx & tx
	LPC_CAN->STAT &= ~(0b11 << 3);
}


uv_errors_e _uv_can_init() {
	uint8_t i;
	for (i = 0; i < CAN_COUNT; i++) {
		this->rx_callback[i] = NULL;
	}
	this->init = true;
	this->used_msg_objs = (1 << (TX_MSG_OBJ - 1));

	uv_ring_buffer_init(&this->rx_buffer, this->rx_buffer_data,
			CONFIG_CAN0_RX_BUFFER_SIZE, sizeof(uv_can_message_st));
	uv_ring_buffer_init(&this->tx_buffer, this->tx_buffer_data,
			CONFIG_CAN0_TX_BUFFER_SIZE, sizeof(uv_can_message_st));

	SystemCoreClockUpdate();

	/* Enable clocking for CAN and reset the controller */
	Chip_Clock_EnablePeriphClock(SYSCTL_CLOCK_CAN);
	Chip_SYSCTL_PeriphReset(RESET_CAN);

	// enable error interrupts & automatic retransmission
	LPC_CAN->CNTL = 0b11 | (1 << 3) | (1 << 6);

	// baudrate prescaler
	// BTR register: TSEG1 = 4, TSEG2 = 3, SJW = 0
	LPC_CAN->BT = ((SystemCoreClock / (CONFIG_CAN0_BAUDRATE * 8) - 1) & 0x3F)
				  | (3 << 8) | (2 << 12);
	LPC_CAN->CLKDIV = 0;

	// init all message objects
	for (int i = 0; i < 32; i++) {
		msg_obj_disable(i + 1);
	}

	/* Enable the CAN Interrupt */
	NVIC_EnableIRQ(CAN_IRQn);

	Chip_IOCON_PinMuxSet(LPC_IOCON, UV_GPIO_PORT(CONFIG_CAN0_TX_PIN),
			UV_GPIO_PIN(CONFIG_CAN0_TX_PIN), (IOCON_MODE_INACT | IOCON_DIGMODE_EN));
	Chip_IOCON_PinMuxSet(LPC_IOCON, UV_GPIO_PORT(CONFIG_CAN0_RX_PIN),
			UV_GPIO_PIN(CONFIG_CAN0_RX_PIN), (IOCON_MODE_INACT | IOCON_DIGMODE_EN));
	Chip_SWM_MovablePortPinAssign(SWM_CAN_TD1_O, UV_GPIO_PORT(CONFIG_CAN0_TX_PIN),
			UV_GPIO_PIN(CONFIG_CAN0_TX_PIN));
	Chip_SWM_MovablePortPinAssign(SWM_CAN_RD1_I,  UV_GPIO_PORT(CONFIG_CAN0_RX_PIN),
			UV_GPIO_PIN(CONFIG_CAN0_RX_PIN));


#if CAN_LOOP_BACK_MODE
	// enable loop-back mode for testing
	LPC_CAN->CNTL |= 1 << 7;
	LPC_CAN->TEST |= 1 << 4;
#endif

#if CONFIG_TERMINAL_CAN
	uv_ring_buffer_init(&this->char_buffer, this->char_buffer_data,
			CONFIG_TERMINAL_BUFFER_SIZE, sizeof(char));
#if !CONFIG_CANOPEN
	uv_can_config_rx_message(CAN0, UV_TERMINAL_CAN_RX_ID + uv_get_id(),
			CAN_ID_MASK_DEFAULT, CAN_STD);
#endif
#endif


	// disable access to bit timing register and start CAN controller operation
	LPC_CAN->CNTL &= ~((1 << 0) | (1 << 6));

	return ERR_NONE;

