usevolt/uv_hal/uv_hal/src_lpc1785/uv_can.c
}




uv_errors_e uv_can_config_rx_message(uv_can_channels_e channel,
		unsigned int id,
		unsigned int mask,
		uv_can_msg_types_e type) {

	uv_errors_e ret = ERR_NONE;

	__disable_irq();

	// check if any message objects are configured to receive this type of data already
	bool match = false;
	for (uint8_t i = 0; i < 32; i++) {
		if (GET_MASKED(this->used_msg_objs, (1 << i))) {

			read_msg_obj(i + 1);
			if ((id == get_msgif_id((type == CAN_EXT))) &&
					(mask == get_msgif_mask(CAN_EXT)) &&
					(get_msgif_type() == (type == CAN_EXT))) {

				match = true;
				break;
			}
		}
	}

	if (!match) {
		// this message is not yet configured.
		// If any message objects are still not in use,
		// config them with settings requested
		// the last message object is reserved for sending messages
		for (uint8_t i = 0; i < 32; i++) {
			// search for a unused message object to be used for receiving the messages
			if (!GET_MASKED(this->used_msg_objs, (1 << i))) {

				msg_obj_disable(i + 1);

				read_msg_obj(i + 1);
				// write receive message data to msg obj
				set_msgif_mask(mask, type);
				LPC_CAN->IF1_MSK2 |= (0b11 << 14);		// use msg type and dir for filtering
				LPC_CAN->IF1_ARB2 = 0;	// msg dir receive, also init ARB2 register
				set_msgif_id(id, (type == CAN_EXT));
				if (type == CAN_EXT) {
					LPC_CAN->IF1_ARB2 |= (1 << 14);
				}
				else {
					LPC_CAN->IF1_ARB2 &= ~(1 << 14);
				}
				LPC_CAN->IF1_MCTRL = (1 << 7) |		// single message (end of buffer)
						(1 << 10) |					// receive interrupt enabled
						(1 << 12);					// use mask for filtering

				write_msg_obj(i + 1, false);
				msg_obj_enable(i + 1);

				this->used_msg_objs |= (1 << i);
				match = true;

				printf("configured msg to be received with msg obj %u\n", i);
				break;
			}
		}
	}

	if (!match) {
		ret = ERR_CAN_RX_MESSAGE_COUNT_FULL;
	}

	__enable_irq();

	return ret;
}



void _uv_can_hal_send(uv_can_channels_e chn) {
	if (chn);

	// if tx object is pending, try to wait for the HAl task to release the pending msg obj
	if ((LPC_CAN->TXREQ1 & 1) || !this->init) {
		return;
	}

	uv_can_message_st msg;
	uv_errors_e e = uv_ring_buffer_pop(&this->tx_buffer, &msg);


	if (e == ERR_NONE) {

		__disable_irq();

		msg_obj_disable(TX_MSG_OBJ);

		set_msgif_id(msg.id, (msg.type == CAN_EXT));

		LPC_CAN->IF1_ARB2 |= (1 << 13) |					// transmit msg
				(((msg.type == CAN_EXT) ? 1 : 0) << 14) |	// frame type
				(1 << 15);									// message valid

		LPC_CAN->IF1_MCTRL = (msg.data_length << 0) |		// data length
				(1 << 7) |									// single message (end of buffer)
				(1 << 8) |									// transmit request
				(1 << 11) |									// transmit int enabled
				(1 << 15);									// new data written by CPU
		LPC_CAN->IF1_DA1 = msg.data_16bit[0];
		LPC_CAN->IF1_DA2 = msg.data_16bit[1];
		LPC_CAN->IF1_DB1 = msg.data_16bit[2];
		LPC_CAN->IF1_DB2 = msg.data_16bit[3];

		// load the message into msg obj
		write_msg_obj(TX_MSG_OBJ, true);

		msg_obj_enable(TX_MSG_OBJ);

		__enable_irq();
	}
}



uv_can_errors_e uv_can_get_error_state(uv_can_channels_e channel) {
	if (channel) {};
	uv_can_errors_e e = CAN_ERROR_ACTIVE;

	if (LPC_CAN->STAT & (1 << 7)) {
		e = CAN_ERROR_BUS_OFF;
	}
	else if (LPC_CAN->STAT & (1 << 5)) {
		e = CAN_ERROR_PASSIVE;
	}
	else if (LPC_CAN->STAT & (1 << 6)) {
		e = CAN_ERROR_WARNING;
	}
	else {

	}
	return e;
}


uv_errors_e uv_can_send_sync(uv_can_channels_e channel, uv_can_message_st *msg) {
	uv_errors_e ret = ERR_NONE;

	if (this->init) {

		// wait until tx msg obj is free
		while (LPC_CAN->TXREQ1 & (1 << (TX_MSG_OBJ - 1))) {
			// if CAN bus is in error state, stop and return
			uv_can_errors_e e = uv_can_get_error_state(channel);
			if (e != CAN_ERROR_ACTIVE) {
				ret = ERR_CAN_BUS_OFF;
				break;
			}
			uv_rtos_task_yield();
		}

		if (ret == ERR_NONE) {

		uv_disable_int();

			msg_obj_disable(TX_MSG_OBJ);

			set_msgif_id(msg->id, (msg->type == CAN_EXT));

			LPC_CAN->IF1_ARB2 |= (1 << 13) |					// transmit msg
					(((msg->type == CAN_EXT) ? 1 : 0) << 14) |	// frame type
					(1 << 15);									// message valid

			LPC_CAN->IF1_MCTRL = (msg->data_length << 0) |		// data length
					(1 << 7) |									// single message (end of buffer)
					(1 << 8) |									// transmit request
					(1 << 11) |									// transmit int enabled
					(1 << 15);									// new data written by CPU
			LPC_CAN->IF1_DA1 = msg->data_16bit[0];
			LPC_CAN->IF1_DA2 = msg->data_16bit[1];
			LPC_CAN->IF1_DB1 = msg->data_16bit[2];
			LPC_CAN->IF1_DB2 = msg->data_16bit[3];

			// load the message into msg obj
			write_msg_obj(TX_MSG_OBJ, true);

			msg_obj_enable(TX_MSG_OBJ);


			uv_enable_int();

			// wait until message is transferred or CAN status changes
			bool br = false;
			while (true) {
				if (!(LPC_CAN->TXREQ1 & 1)) {
					br = true;
				}
				else if (LPC_CAN->STAT & (0b111 << 5)) {
					br = true;
					ret = ERR_CAN_BUS_OFF;
				}
				else {

				}
				if (br) {
					break;
				}
			}
		}
	}
	else {
		ret = ERR_NOT_INITIALIZED;
	}

	return ret;
}



#elif CONFIG_TARGET_LINUX
uv_errors_e _uv_can_init() {
	uv_errors_e ret = ERR_NONE;

	return ret;
}

#else
#error "Controller not defined"
#endif











/*
 * GLOBAL FUNCTIONS ACROSS TARGET MCU's
 */


#if CONFIG_TERMINAL_CAN
uv_errors_e uv_can_get_char(char *dest) {
	return uv_ring_buffer_pop(&this->char_buffer, dest);
}
#endif



uv_errors_e uv_can_send_message(uv_can_channels_e channel, uv_can_message_st* message) {
	uv_disable_int();
	uv_errors_e ret = ERR_NONE;
#if (CONFIG_TARGET_LPC1549 || CONFIG_TARGET_LPC11C14)
	ret = uv_ring_buffer_push(&this->tx_buffer, message);
#elif CONFIG_TARGET_LPC1785
	ret = uv_ring_buffer_push(&this->tx_buffer[channel], message);
#endif
	uv_enable_int();
	return ret;
}



uv_errors_e uv_can_pop_message(uv_can_channels_e channel, uv_can_message_st *message) {
	uv_errors_e ret = ERR_NONE;
	uv_disable_int();
#if (CONFIG_TARGET_LPC1549 || CONFIG_TARGET_LPC11C14)
	ret = uv_ring_buffer_pop(&this->rx_buffer, message);
#elif CONFIG_TARGET_LPC1785
	ret = uv_ring_buffer_pop(&this->rx_buffer[channel], message);
#endif
	uv_enable_int();
	return ret;
}



uv_errors_e uv_can_reset(uv_can_channels_e channel) {
#if CONFIG_TARGET_LPC11C14
	//clearing the C_CAN bit resets C_CAN hardware
	LPC_SYSCON->PRESETCTRL &= ~(1 << 3);
	//set bit to de-assert the reset
	LPC_SYSCON->PRESETCTRL |= (1 << 3);
#elif CONFIG_TARGET_LPC1549
	Chip_SYSCTL_PeriphReset(RESET_CAN);

#endif
	return ERR_NONE;
}



/// @brief: Inner hal step function which is called in rtos hal task
void _uv_can_hal_step(unsigned int step_ms) {

#if C_CAN
	if (this->tx_pending > 0) {
		this->tx_pending -= step_ms;
	}
	else if (this->tx_pending == 0) {
		this->tx_pending = -1;
	}
#endif

	// send the next message from the buffer
#if CONFIG_CAN0
	_uv_can_hal_send(CAN0);
#endif
#if CONFIG_CAN1
	_uv_can_hal_send(CAN1);
#endif
}


#endif
